Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/buying_or_selling_a_vehicle/change_of_ownership.html.txt.tmx
Source language: en
Languages: ga

source: If you sell your vehicle or trade it in for a new model, you must register the change of ownership
ga: Má dhíolann tusa feithicil nó é a chur mar pháirt-íocaíocht i gcoinne ceann nua, caithfidh tú an t-athrú úinéireachta a chlárú

source: This is done in one of two ways and depends on whether the vehicle was first registered before or after January 1993
ga: Déantar é seo i gceann de dhá bhealach, ag brath ar an raibh an carr cláraithe ar dtús, roimh nó i ndiaidh an 1ú Eanáir 1993

source: You register a change of ownership at your local Motor Taxation Office if your vehicle was first registered before 1 January 1993
ga: Féadfaidh tú athrú úinéireachta a chlárú ag d’Oifig Mótarchánach áitiúil má cláraíodh d’fheithicil roimh Eanáir 1993

source: If it was first registered after this date, the change of ownership must be registered directly with the Driver and Vehicle Computer Services Division of the Department of Transport, Tourism and Sport
ga: Má cláraíodh í i ndiaidh an dáta seo, ní mór an t-athrú úinéireachta a chlárú go díreach leis an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí den Roinn Iompair, Tuarasóireachta agus Spóirt

source: Where your vehicle was first registered after April 2004 a new form of Vehicle Registration Certificate would have been issued
ga: Sa chás gur cláraíodh d’fheithicil i ndiaidh Aibreán 2004, bheadh foirm nua den Teastas Cláraithe Feithicle arna heisiúint

source: This replaced both the Vehicle Registration Certificate and the Vehicle Licensing Certificate issued for cars registered before April 2004
ga: Tháinig sé seo in ionad an Teastais Chláraithe Feithicle agus an Teastais Cheadúnaithe Feithicle araon a eisíodh do ghluaisteáin a cláraíodh roimh Aibreán 2004

source: Vehicles registered before January 1993
ga: Feithicil cláraithe roimh 1993

source: Information on change of ownership for pre-1993 vehicles is available on the Department of Transport, Tourism and Sport website
ga: Tá eolas ar athrú úinéireachta d'fheithiclí réamh-1993 ar fáil ar shuíomh gréasáin na Roinne Iompair, Turasóireachta agus Spóirt

source: Selling a vehicle registered after 1 January 1993
ga: Ag díol feithicil, cláraithe ar nó roimh 1ú Eanáir 1993

source: If you sell a pre-April 2004 vehicle privately, part B of the Vehicle Licensing Certificate, which you would have received when you bought the vehicle, should be completed and returned to the Driver and Vehicle Computer Services Division of the Department of Transport, Tourism and Sport
ga: Má dhíolann tú feithicil le clárú roimh Aibreán 2004 go príobháideach, ba cheart Cuid B den Teastas Ceadúnaithe Feithicle a chomhlánú. Ba cheart go bhfuair tú seo nuair a cheannaigh tú an fheithicil, agus ba cheart í a sheoladh ar ais chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí den Roinn Iompair, Tuarasóireachta agus Spóirt

source: The new details will be registered and the certificate will be sent to the new owner
ga: Clárófar na sonraí nua agus seolfar an teastas chuig an úinéir nua

source: The Vehicle Registration Certificate, which you also get when you buy a pre-April 2004 vehicle, should be given to the new owner at the time of the sale
ga: Ba cheart an Teastas Cláraithe Feithicle, a fhaigheann tú freisin nuair a cheannaíonn tú feithicil le clárú roimh Aibreán 2004, a thabhairt don úinéir nua ag tráth an díolta

source: If you sell a post-April 2004 vehicle privately, part B of the Vehicle Registration Certificate which you would have received when you bought the vehicle, should be completed and returned to the Driver and Vehicle Computer Services Division
ga: Má dhíolann tú feithicil le clárú roimh Aibreán 2004 go príobháideach, ba cheart Cuid B den Teastas Ceadúnaithe Feithicle a chomhlánú. Ba cheart go bhfuair tú seo nuair a cheannaigh tú an fheithicil, agus ba cheart í a sheoladh ar ais chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí

source: If you sell your vehicle to a motor dealer, you have to complete Form RF105 (pdf) which is available from the motor dealer
ga: Má dhíolann tú d’fheithicil le déileálaí gluaisteán, ní mór duit Foirm RF105 (pdf) a chomhlánú

source: The completed form should be returned to the Driver and Vehicle Computer Services Division, while the Vehicle Licensing Certificate and Vehicle Registration Certificates (Vehicle Registration Certificate for post-April 2004 vehicles) are given to the motor dealer
ga: Tá fáil uirthi ón déileálaí gluaisteán. Ba cheart an fhoirm chomhlánaithe a sheoladh ar ais chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí, agus tugtar an Teastas Ceadúnaithe Feithicle agus an Teastas Cláraithe Feithicle (Teastas Cláraithe Feithicle d’fheithiclí le clárú roimh Aibreán 2004) don déileálaí gluaisteán

source: When selling a vehicle to a motor dealer in either transaction, a valid garage code must be supplied on behalf of the motor dealer
ga: Nuair a bhíonn feithicil á díol agat le déileálaí gluaisteán ní mór cód bailí garáiste a sholáthar ar son an déileálaí gluaisteán i gceachtar idirbheartaíocht

source: Failure to supply this code will result in the change of ownership being rejected - by either your Motor Tax Office or the Driver and Vehicle Computer Services Division
ga: Má theipeann orthu an cód seo a sholáthar, diúltóidh d’Oifig Mótarchánach nó an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí an t-athrú úinéireachta

source: The motor dealer can only obtain a valid garage code from the Department in Co
ga: Ní féidir leis an déileálaí gluaisteán cód bailí garáiste a fháil ach ón Roinn i gContae an Chláir trí dhianchritéir a chomhlíonadh

source: Clare by fulfilling strict criteria. (See "Where to apply" for contact information
ga: (Féach “Cá ndéanfaidh mé iarratas” chun teacht ar fhaisnéis faoi theagmháil

source: If you are selling your vehicle to a person resident outside the State, you must send the Vehicle Registration Certificate and the purchaser’s name and address details to the Driver and Vehicle Computer Services Division
ga: Má tá tú ag díol do feithicle le duine a chónaíonn lasmuigh den Stát, ní mór duit a sheoladh chuig an Deimhniú Clárúcháin Feithicle agus ainm agus seoladh na sonraí an cheannaitheora chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí

source: They will assist the authorities in the purchaser’s state with vehicle details
ga: Beidh siad cuidiú leis na húdaráis sa cheannaitheora stáit le sonraí feithicle

source: The record of your vehicle on the National Vehicle and Driver File will continue to be recorded in your name until confirmation is received from the authorities in the purchaser’s state that the car has been imported into that country and registered there
ga: Beidh an taifead ar d'fheithicil ar an gComhad Náisiúnta Feithiclí agus Tiománaithe aghaidh ag a thaifeadadh i d'ainm go dtí go bhfaighfear dearbhú ó na húdaráis sa cheannaitheora stát go bhfuil an carr allmhairítear isteach go tír agus atá cláraithe ann

source: Buying a vehicle registered after 1 January 1993
ga: Ag ceannach feithicil cláraithe taréis 1ú Eanáir 1993

source: If you privately buy a vehicle that was first registered after this date, the seller must fill in your details on part B of the Vehicle Licensing Certificate (Vehicle Registration Certificate for post-April 2004 vehicles) and return it to the Driver and Vehicle Computer Services Division
ga: Má cheannaíonn tú feithicil go príobháideach a cláraíodh i ndiaidh an dáta seo, ní mór don díoltóir do chuid sonraí a chomhlánú i gCuid B den Teastas Ceadúnaithe Feithicle (Teastas Cláraithe Feithicle le haghaidh feithiclí le clárú roimh Aibreán 2004) agus é a sheoladh ar ais chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí

source: The new details will be registered and the amended certificate will be sent to you
ga: Clárófar na sonraí nua agus seolfar an teastas leasaithe chuagat

source: The seller will give the Vehicle Registration Certificate for a pre-April 2004 vehicle to you when you buy the vehicle
ga: Tabharfaidh an díoltóir an Teastas Cláraithe Feithicle d’fheithicil le clárú roimh Aibreán 2004 duit nuair a cheannaíonn tú an fheithicil

source: If you buy a vehicle and the current owner (seller) is deceased, a letter from the executor of the deceased's will, or the solicitor dealing with the will, indicating your right to the vehicle should accompany the Vehicle Registration Certificate (VRC)
ga: Má cheannaíonn tú feithicil agus má tá an t-úinéir reatha (an díoltóir) éagtha, ba cheart go ngabhfadh litir ó sheiceadóir uacht an duine éagtha, nó ón aturnae a dhéileálann leis an uacht leis an Deimhniú Clárúcháin Feithicle (DCF) a thugann le fios go bhfuil sé de cheart agat an fheithicil a shealbhú

source: Where the VRC is not available or cannot be produced, an administrative process allows the acceptance of a declaration of ownership change in the form of a statutory declaration sworn before a Commissioner for Oaths or a practising solicitor
ga: Sa chás nach bhfuil fáil ar an DCF nó nach féidir é a sholáthar, ceadaíonn próiseas riaracháin chun dearbhú um athrú úinéireachta a ghlacadh i bhfoirm dhearbhaithe reachtúil a mhionnaítear os comhair Coimisinéir Mionnaí nó aturnae cleachtach

source: The statutory declaration form, which is available from the Driver and Vehicle Computer Services Division, should accompany the letter from the executor of the will or the solicitor mentioned above
ga: Ba cheart go ngabhfadh an fhoirm um dhearbhú reachtúil, atá ar fáil ón Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí, leis an litir ó sheiceadóir na huachta nó ón aturnae a luaitear thuas

source: You cannot tax your vehicle until the registration of the change of ownership has gone through
ga: Ní féidir leat cáin a d'fheithicil go dtí go mbeidh clárú an athrú úinéireachta imithe tríd

source: You can check the status of the vehicle on motortax.ie
ga: Is féidir leat seiceáil an stádas na feithicle ar motortax.ie

source: You can then renew the motor tax on the vehicle using Form RF100A or online
ga: Is féidir leat a athnuachan ansin an mótarcháin ar an bhfeithicil ag baint úsáide as Foirm RF100A nó ar líne

source: If the motor tax has already expired, you are not liable for the arrears period from the expiry of the last tax disc to the end of the month immediately preceding the date of sale.See document on motor tax
ga: Má tá an mótarchánach in éag cheana féin, nach bhfuil tú faoi dhliteanas na riaráistí don tréimhse ón lá a ndeachaidh an diosca cánach deiridh go dtí deireadh na míosa díreach roimh an dáta an díolacháin. Féach doiciméad ar mótarchánach

source: It is possible to obtain replacement documents associated with changes to vehicle ownership
ga: Is féidir cáipéisí athsholáthair a fháil a bhaineann le hathruithe ar úinéireacht feithicile

source: List of documents and the cost of their replacement is as follows;
ga: Is mar seo a leanas atá an liosta cáipéisí agus an costas a bhaineann lena n-athsoláthar;

source: Vehicle licensing certificate €12
ga: Teastas ceadúnúcháin feithicile €12

source: To obtain replacement documents, download and complete form RF134 (pdf) and have this form witnessed by a member of the Garda Siochana at a Garda station
ga: Chun cáipéisí athsholáthair a fháil, íoschóipeáil agus comhlánaigh foirm RF134 (pdf) agus agus iarr ar bhall den Gharda Síochána ag stáisiún Gardaí a bheith ina bhfinné ar an bhfoirm

source: Forward your completed form with the appropriate fee to your Motor Tax Office
ga: Seol d’fhoirm chomhlánaithe leis an táille chuí chuig d’Oifig Mhótarchánach

source: If your address has changed, fill in the appropriate details on the Vehicle Licensing Certificate (Vehicle Registration Certificate for post-April 2004 vehicles) and send it to the Driver and Vehicle Computer Services Division
ga: Má d’athraigh do sheoladh, comhlánaigh na sonraí cuí ar an Teastas Ceadúnaithe Feithicle (Teastas Cláraithe Feithicle le haghaidh feithiclí le clárú roimh Aibreán 2004) agus déan é a sheoladh ar ais chuig an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí

source: There is no charge for registering Change of Ownership details at Motor Taxation Offices or at the Driver and Vehicle Computer Services Division
ga: Níl aon táille le n-íoc le sonraí Athrú úinéireachta a chlárú ag na hOifigí Cánach Mótarach nó ag an Rannán Seirbhísí Ríomhaireachta agus Tiománaithe Feithiclí
